In [1]:
import pandas as pd

In [5]:
data = ["1",2,"three",4]
Series = pd.Series(data)

In [6]:
Series

0        1
1        2
2    three
3        4
dtype: object

In [8]:
# groupby
df = pd.DataFrame({'vehicle':['Kia','Lamborghini','KTM','Pulsar'],'type':['car','car','motorbike','motorbike']})

In [9]:
df

       vehicle       type
0          Kia        car
1  Lamborghini        car
2          KTM  motorbike
3       Pulsar  motorbike

In [16]:
df.groupby('type').count()

           vehicle
type
car              2
motorbike        2

In [17]:
df =pd.DataFrame()
bikes = ['bajaj','TVS','honda','kawaaskai','BmW']
cars = ['Lamborghini','Maserrati','Ferrari','Hyundai','Ford']
df['Cars'] = cars
df['bikes'] = bikes

In [18]:
df

          Cars      bikes
0  Lamborghini      bajaj
1    Maserrati        TVS
2      Ferrari      honda
3      Hyundai  kawaaskai
4         Ford        BmW

In [19]:
bikes = ['bajaj','TVS','honda','kawaaskai','BmW']
cars = ['Lamborghini','Maserrati','Ferrari','Hyundai','Ford']
data= ({'cars':cars,'bikes':bikes})
df = pd.DataFrame(data)

In [20]:
df

          cars      bikes
0  Lamborghini      bajaj
1    Maserrati        TVS
2      Ferrari      honda
3      Hyundai  kawaaskai
4         Ford        BmW

In [24]:
import numpy as np

In [26]:
n1= np.array([1,5,5,3,100,4,48])

In [31]:
mean = np.mean(n1)
median = np.median(n1)
mode = np.std(n1)
print(mean)
print(median)
print(mode)

23.714285714285715
5.0
34.73044891205198

In [32]:
string = 'Greatlearning'
print(string.lower())

greatlearning

In [33]:
data= ({'cars':cars,'bikes':bikes})
data.keys()

dict_keys(['cars', 'bikes'])

In [3]:
n = 'greatlearning'
print(n.capitalize())

Greatlearning

In [36]:
list= [0,1,2,3,4,5,6,7]
list.insert(6,15)

In [37]:
list

[0, 1, 2, 3, 4, 5, 15, 6, 7]

In [38]:
list = [i for i in range(1000)]

In [48]:
def add_func(n):
    return n*3
num = (1,2,3,4,5,6)
result = map(add_func,num)

In [49]:
list(result)

[3, 6, 9, 12, 15, 18]

In [50]:
n = 10

In [52]:
type(n)

int

In [54]:
new_n = str(n)
type(new_n)

str

In [56]:
str = 'greatlearning'
print(len(str))

13

In [57]:
number = lambda x:x * 3
number(5)

15

In [60]:
def factorial(a):
    if a==1:
        return a
    else:
        return(a*factorial(a-1))
print()

In [61]:
a = [1,2,3]
b = [2,3,5]
d = {"col":a,"col2":b}
data = pd.DataFrame(d)

In [62]:
data

   col  col2
0    1     2
1    2     3
2    3     5

In [64]:
data['sum'] = data['col'] + data['col2']

In [66]:
data

   col  col2  sum
0    1     2    3
1    2     3    5
2    3     5    8

In [67]:
data['difference'] = data['col'] - data['col2']

In [69]:
data

   col  col2  sum  difference
0    1     2    3          -1
1    2     3    5          -1
2    3     5    8          -2

In [70]:
s1 = {1,2,3,4,5,6}
s2 = {5,6,7,8,9}
s1.intersection(s2)

{5, 6}